<template>
  <div class="p-3">
    <p class="mt-8 font-bold mb-4">سوالات متداول</p>
    <UAccordion
      :items="items"
      :ui="{
        wrapper: 'flex flex-col w-full gap-4',
        container: 'border rounded-lg border-gray-100 dark:border-gray-700',
        item: {
          base: 'text-xs mx-3 !py-3 border-t border-solid border-gray-100 dark:border-gray-700',
        },
      }">
      <template #default="{ item, open }">
        <UButton
          color="gray"
          variant="ghost"
          :ui="{ rounded: 'rounded-none', padding: { sm: 'p-3' } }">
          <span class="truncate font-normal text-xs">{{ item.label }}</span>
          <template #trailing>
            <UIcon
              name="i-heroicons-chevron-down-20-solid"
              class="w-5 h-5 ms-auto transform transition-transform duration-200"
              :class="[open && 'rotate-180']" />
          </template>
        </UButton>
      </template>
    </UAccordion>
  </div>
</template>

<script setup>
const items = [
  {
    label: " فرآیند فروش گوشی کارکرده به دیجی‌کالا به چه صورت است؟‌ ",
    content:
      "پس از ثبت درخواست فروش گوشی در سایت، سفیر دیجی‌کالا گوشی کارکرده شما را تحویل می‌گیرد و به مرکز کارشناسی تحویل می‌دهد. پس از انجام فرآیند کارشناسی، در صورتی که شرایط دستگاه مطابق با درخواست ثبت‌شده باشد، مبلغ آن برای شما واریز می‌شود؛ در غیر این صورت، دستگاه مجددا برای شما ارسال می‌شود. ",
  },
  {
    label: " گوشی کارکرده در دیجی‌کالا چگونه قیمت‌گذاری می‌شود؟ ",
    content:
      "گوشی‌های کارکرده در دیجی‌کالا بر اساس فاکتورهای مختلفی مانند میزان سلامت فنی و ظاهری دستگاه، میزان عرضه و تقاضا، نرخ ارز، معاملات روز بازار، لوازم جانبی دستگاه و سابقه تعمیرات قیمت‌گذاری می‌شود.",
  },
  {
    label:
      " گوشی‌های کارکرده مشابه نو، با خط و خش جزئی و با خط و خش زیاد چه مشخصاتی دارند؟ ",
    content: `وضعیت سلامت ظاهری گوشی کارکرده به صورت زیر مشخص می‌شود:
مشابه نو: بدون هیچ‌گونه خط و خش
خط و خش جزئی: تا ۳ خط و خش جزئی روی بدنه گوشی
خط و خش زیاد: بیش از ۳ خط و خش جزئی یا بیش از یک خط عمیق روی بدنه`,
  },
  {
    label: "چرا امکان ثبت درخواست فروش فوری برای برخی از مدل‌ها وجود ندارد؟",
    content:
      "در حال حاضر دیجی‌کالا تنها گوشی‌های کارکرده‌ای را خریداری می‌کند که تقاضای بالایی در بازار دارند. به زودی مدل‌های بیشتری در لیست خرید دیجی‌کالا قرار خواهند گرفت. ",
  },
  {
    label: " مبلغ دستگاه فروخته‌شده چه زمانی به حساب من واریز می‌شود؟  ",
    content:
      "بعد از کارشناسی گوشی کارکرده و دریافت انتقال مالکیت آن، کیف پول حساب کاربری شما در دیجی‌کالا به میزان مبلغ دستگاه شارژ می‌شود. از همان لحظه می‌توانید درخواست برداشت از کیف پول خود را ثبت کنید تا مبلغ به شماره حساب ثبت‌شده در حساب کاربری‌تان واریز شود. ",
  },
  {
    label: "اگر گوشی کارکرده در فرآیند کارشناسی تایید نشود چه اتفاقی می‌افتد؟",
    content:
      "در صورتی که گوشی کارکرده مشکلات فنی داشته باشد و در فرآیند کارشناسی تایید نشود، دستگاه پس از هماهنگی با شما به محل مورد نظرتان ارسال می‌شود. ",
  },
  {
    label: "پارت‌نامبر گوشی آیفون را از کجا تشخیص دهم؟",
    content:
      "وارد تنظیمات گوشی آیفون خود شوید. بخش General را باز کرده و وارد قسمت About شوید. سه حرف آخر عبارت نوشته‌شده روبه‌روی Model Number، نشان‌دهنده پارت‌نامبر گوشی شما است. لازم به ذکر است که از قسمت Model Number روی برچسب جعبه گوشی نیز می‌توانید پارت‌نامبر را پیدا کنید. ",
  },
  {
    label: " فرآیند کارشناسی گوشی کارکرده چه‌قدر زمان‌بر است؟ ",
    content:
      "پس از تحویل گوشی به سفیر دیجی‌کالا، دستگاه به مرکز کارشناسی دیجی‌کالا ارسال و فرآیند کارشناسی آن آغاز می‌شود. در حال حاضر فرآیند کارشناسی گوشی کارکرده در تهران کمتر از 48 ساعت است و در سایر شهرها بین ۳ تا ۵ روز کاری زمان می‌برد. ",
  },
  {
    label:
      "  گوشی کارکرده باید با چه شرایطی به سفیر دیجی‌کالا تحویل داده شود؟ ",
    content:
      "قبل از تحویل گوشی به سفیر دیجی‌کالا، آن را به تنظیمات کارخانه بازگردانید و اطلاعات خود را به طور کامل پاک کنید. دیجی‌کالا مسئولیتی در قبال اطلاعات شما ندارد. همچنین لازم است که دستگاه را به همراه جعبه اصلی و لوازم جانبی آن به سفیر تحویل دهید. در صورتی که لوازم جانبی دستگاه کامل نباشد، هزینه آن از مبلغ کل کم می‌شود. ",
  },
];
</script>

<style scoped></style>
